; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v10 ?v3)
             (pred_3 ?v11 ?v2)
             (pred_6 ?v10 ?v2)
             (pred_12 ?v9 ?v10 )
	     (pred_1 ?v10)
             (pred_5 ?v12)
             (pred_9 ?v11)
             (pred_10 ?v2)
             (pred_11 ?v10)
             (pred_8 ?v11)
             (pred_2 ?v10)
             (pred_4 ))



(:action op_2
:parameters (?v4 ?v6 ?v13 ?v8)
:precondition (and (pred_5 ?v4) (pred_5 ?v6) (pred_9 ?v13) (pred_10 ?v8)
          (pred_7 ?v4 ?v6) (pred_3 ?v13 ?v8)
                   (pred_6 ?v6 ?v8) (pred_1 ?v4) 
                   (pred_11 ?v6) (pred_8 ?v13))
:effect (and  (pred_2 ?v6) (not (pred_11 ?v6))))


(:action op_5
:parameters (?v4 ?v7)
:precondition (and (pred_5 ?v4) (pred_5 ?v7)
               (pred_1 ?v4) (pred_7 ?v4 ?v7) (pred_2 ?v7))
:effect (and (pred_1 ?v7) (not (pred_1 ?v4))))

(:action op_3
:parameters (?v4 ?v13)
:precondition (and (pred_5 ?v4) (pred_9 ?v13) 
                  (pred_1 ?v4) (pred_12 ?v13 ?v4) (pred_4 ))
:effect (and (pred_8 ?v13)
   (not (pred_12 ?v13 ?v4)) (not (pred_4 ))))


(:action op_4
:parameters (?v4 ?v5 ?v1)
:precondition (and (pred_5 ?v4) (pred_9 ?v5) (pred_9 ?v1)
                  (pred_1 ?v4) (pred_8 ?v1) (pred_12 ?v5 ?v4))
:effect (and (pred_8 ?v5) (pred_12 ?v1 ?v4)
        (not (pred_8 ?v1)) (not (pred_12 ?v5 ?v4))))

(:action op_1
:parameters (?v4 ?v13)
:precondition (and (pred_5 ?v4) (pred_9 ?v13) 
                  (pred_1 ?v4) (pred_8 ?v13))
:effect (and (pred_4 ) (pred_12 ?v13 ?v4) (not (pred_8 ?v13)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_10 obj_03 obj_07 obj_11 obj_20 obj_05 obj_12 obj_13 obj_08 obj_06 obj_09 obj_16 obj_04 obj_01 obj_15 obj_19
    obj_18 obj_02
    obj_17 obj_14
    )

    (:init
       (pred_4)

       (pred_5 obj_10)
       (pred_5 obj_03)
       (pred_5 obj_07)
       (pred_5 obj_11)
       (pred_5 obj_20)
       (pred_5 obj_05)
       (pred_5 obj_12)
       (pred_5 obj_13)
       (pred_5 obj_08)
       (pred_5 obj_06)
       (pred_5 obj_09)
       (pred_5 obj_16)
       (pred_5 obj_04)
       (pred_5 obj_01)
       (pred_5 obj_15)
       (pred_5 obj_19)
       (pred_10 obj_18)
       (pred_10 obj_02)
       (pred_9 obj_17)
       (pred_9 obj_14)

       (pred_7 obj_10 obj_20)
       (pred_7 obj_10 obj_03)
       (pred_7 obj_03 obj_05)
       (pred_7 obj_03 obj_07)
       (pred_7 obj_03 obj_10)
       (pred_7 obj_07 obj_12)
       (pred_7 obj_07 obj_11)
       (pred_7 obj_07 obj_03)
       (pred_7 obj_11 obj_13)
       (pred_7 obj_11 obj_07)
       (pred_7 obj_20 obj_08)
       (pred_7 obj_20 obj_05)
       (pred_7 obj_20 obj_10)
       (pred_7 obj_05 obj_06)
       (pred_7 obj_05 obj_12)
       (pred_7 obj_05 obj_03)
       (pred_7 obj_05 obj_20)
       (pred_7 obj_12 obj_09)
       (pred_7 obj_12 obj_13)
       (pred_7 obj_12 obj_07)
       (pred_7 obj_12 obj_05)
       (pred_7 obj_13 obj_16)
       (pred_7 obj_13 obj_11)
       (pred_7 obj_13 obj_12)
       (pred_7 obj_08 obj_04)
       (pred_7 obj_08 obj_06)
       (pred_7 obj_08 obj_20)
       (pred_7 obj_06 obj_01)
       (pred_7 obj_06 obj_09)
       (pred_7 obj_06 obj_05)
       (pred_7 obj_06 obj_08)
       (pred_7 obj_09 obj_15)
       (pred_7 obj_09 obj_16)
       (pred_7 obj_09 obj_12)
       (pred_7 obj_09 obj_06)
       (pred_7 obj_16 obj_19)
       (pred_7 obj_16 obj_13)
       (pred_7 obj_16 obj_09)
       (pred_7 obj_04 obj_01)
       (pred_7 obj_04 obj_08)
       (pred_7 obj_01 obj_15)
       (pred_7 obj_01 obj_06)
       (pred_7 obj_01 obj_04)
       (pred_7 obj_15 obj_19)
       (pred_7 obj_15 obj_09)
       (pred_7 obj_15 obj_01)
       (pred_7 obj_19 obj_16)
       (pred_7 obj_19 obj_15)
       (pred_11 obj_03)
       (pred_11 obj_11)
       (pred_6  obj_03 obj_18)
       (pred_6  obj_11 obj_02)
       (pred_2 obj_10)
       (pred_2 obj_07)
       (pred_2 obj_20)
       (pred_2 obj_05)
       (pred_2 obj_12)
       (pred_2 obj_13)
       (pred_2 obj_08)
       (pred_2 obj_06)
       (pred_2 obj_09)
       (pred_2 obj_16)
       (pred_2 obj_04)
       (pred_2 obj_01)
       (pred_2 obj_15)
       (pred_2 obj_19)

       (pred_3  obj_17 obj_18)
       (pred_3  obj_14 obj_02)
       (pred_12 obj_17 obj_16)
       (pred_12 obj_14 obj_15)
       (pred_1 obj_19)
    )

    (:goal (and
       (pred_12 obj_14 obj_11)
    ))
(:constraints
  (always (not (pred_1 obj_07)))
)
)

; plan
1. (op_5 obj_19 obj_15)
   deleted: (pred_1 obj_19)
   added: (pred_1 obj_15)
   goals met: 0 of 1
2. (op_3 obj_15 obj_14)
   deleted: (pred_12 obj_14 obj_15) (pred_4)
   added: (pred_8 obj_14)
   goals met: 0 of 1
3. (op_5 obj_15 obj_09)
   deleted: (pred_1 obj_15)
   added: (pred_1 obj_09)
   goals met: 0 of 1
4. (op_5 obj_09 obj_12)
   deleted: (pred_1 obj_09)
   added: (pred_1 obj_12)
   goals met: 0 of 1
5. (op_5 obj_12 obj_13)
   deleted: (pred_1 obj_12)
   added: (pred_1 obj_13)
   goals met: 0 of 1
6. (op_2 obj_13 obj_11 obj_14 obj_02)
   deleted: (pred_11 obj_11)
   added: (pred_2 obj_11)
   goals met: 0 of 1
7. (op_5 obj_13 obj_11)
   deleted: (pred_1 obj_13)
   added: (pred_1 obj_11)
   goals met: 0 of 1
8. (op_1 obj_11 obj_14)
   deleted: (pred_8 obj_14)
   added: (pred_4) (pred_12 obj_14 obj_11)
   goals met: 1 of 1
